[M_Orchid_KnowItWhenSeeIt MissionDefinition]
MissionDescription="A malfunctioning Hyperion loader calling itself C3n50r807 has offered you a job. He knows of a robot named P3RV-E who is in possession of pornographic materials. C3n50r807 wants you to find P3RV-E, kill him, and collect the illicit materials."
MissionGiver="C3n50r807"
MissionTurnInLocation="C3n50r807t"
TeaserText="This malfunctioning Hyperion bot seems to be obsessed with censorship..."

[M_Orchid_KnowItWhenSeeIt:CollectMags MissionObjectiveDefinition]
ProgressMessage="Recover immoral magazines"
